---
kind: method
id: M:Autodesk.Revit.DB.FormArray.Insert(Autodesk.Revit.DB.Form,System.Int32)
source: html/d0c01311-3ff4-dc78-6352-deeb6ee9aa35.htm
---
# Autodesk.Revit.DB.FormArray.Insert Method

## Syntax (C#)
```csharp
public virtual void Insert(
	Form item,
	int index
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Form`)
- **index** (`System.Int32`)